/*=========================================================================\
* Copyright(C)2016 Chudai.
*
* File name    : main.c
* Version      : v1.0.0
* Author       : 初代
* Date         : 2016/06/20
* Description  :
* Function list: 1.
*                2.
*                3.
* History      :
\*=========================================================================*/

/*-----------------------------------------------------------*
 * 头文件                                                    *
 *-----------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "binary_search.h"
/*-----------------------------------------------------------*
 * 外部变量说明                                              *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 外部函数原型说明                                          *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 内部函数原型说明                                          *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 全局变量                                                  *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 模块级变量                                                *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 常量定义                                                  *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 宏定义                                                    *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 函数实现                                                  *
 *-----------------------------------------------------------*/

int main(void)
{
    int         option = 0;
    BTnode_s    *root = NULL;
    int         value = 0;
    BTnode_s    *tempnode = NULL;


    while(1)
    {
        printf("\n\r1.插入节点(从左到右，从上到下)\n"
                "\r2.删除节点\n"
                "\r3.查找节点\n"
                "\r4.查找最小节点(递归实现)\n"
                "\r5.查找最大节点(非递归实现)\n"
                "\r6.前序遍历\n"
                "\r7.中序遍历\n"
                "\r8.后序遍历\n"
                "\r9.层次遍历\n"
                "\r10.退出程序\n");
        scanf("%d", &option);

        switch(option)
        {
            case 1:
                printf("输入要插入的数值: ");
                scanf("%d", &value);
                insert_node(&root, value);
                break;
            case 2:
                printf("输入要删除数值：");
                scanf("%d", &value);
                delete_node(&root, value);
                break;
            case 3:
                printf("输入要查找数值: ");
                scanf("%d", &value);
                if ((tempnode = find_node(root, value)) != NULL)
                {
                     printf("找到! value = %d\n", tempnode->value);
                }
                else
                {
                    printf("没找到!\n");
                }

                break;
            case 4:
                tempnode = find_min_max_node(root, MINNODEFLAG);
                printf("最小节点值为: %d\n", tempnode->value);
                break;
            case 5:
                tempnode = find_min_max_node(root, MAXNODEFLAG);
                printf("最大节点值为: %d\n", tempnode->value);
                break;
            case 6:
                traverse(root, 1);
                break;
            case 7:
                traverse(root, 2);
                break;
            case 8:
                traverse(root, 3);
                break;
            case 9:
                traverse(root, 4);
                break;
            case 10:
                exit(0);
                break;
            default:
                break;
        }
    }

}
