/*=========================================================================\
* Copyright(C)2016 Chudai.
*
* File name    : stack.h
* Version      : v1.0.0
* Author       : i.sshe
* Github       : github.com/isshe
* Date         : 2016/06/17
* Description  :
* Function list: 1.
*                2.
*                3.
* History      :
\*=========================================================================*/

#ifndef STACK_H_
#define STACK_H_

#ifdef __cplusplus
extern "C"{
#endif

/*=========================================================================*\
 * #include#                                                               *
\*=========================================================================*/

/*=========================================================================*\
 * #define#                                                                *
\*=========================================================================*/
#define EMPTY   -1

/*=========================================================================*\
 * #enum#                                                                  *
\*=========================================================================*/

/*=========================================================================*\
 * #struct#                                                                *
\*=========================================================================*/
typedef struct _STACK_S_
{
     int    *array;
     int    top;
}stack_s;

/*=========================================================================*\
 * #function#                                                              *
\*=========================================================================*/

/*=====================================================================\
* Function   (名称): create_stack()
* Description(功能): 新建一个空栈
* Called By  (被调): 1.
* Call_B file(被文): 1.
* Calls list (调用): 1.
* Calls file (调文): 1.
* Input      (输入): 1.
* Output     (输出): 1.
* Return     (返回):
*         success  :
*         failure  :
* Change log (修改): 1.
* Others     (其他): 1.
\*=====================================================================*/
int create_stack(stack_s **stack, int size);

/*=====================================================================\
* Function   (名称): push_stack()
* Description(功能): 入栈
* Called By  (被调): 1.
* Call_B file(被文): 1.
* Calls list (调用): 1.
* Calls file (调文): 1.
* Input      (输入): 1.
* Output     (输出): 1.
* Return     (返回):
*         success  :
*         failure  :
* Change log (修改): 1.
* Others     (其他): 1.
\*=====================================================================*/
int push_stack(stack_s *stack, int value, int size);


/*=====================================================================\
* Function   (名称): pop_stack()
* Description(功能): 出栈
* Called By  (被调): 1.
* Call_B file(被文): 1.
* Calls list (调用): 1.
* Calls file (调文): 1.
* Input      (输入): 1.
* Output     (输出): 1.
* Return     (返回): 出栈的值
*         success  :
*         failure  :
* Change log (修改): 1.
* Others     (其他): 1.
\*=====================================================================*/
int pop_stack(stack_s *stack);


/*=====================================================================\
* Function   (名称): clear_stack()
* Description(功能): 清空一个栈但不释放栈。
* Called By  (被调): 1.
* Call_B file(被文): 1.
* Calls list (调用): 1.
* Calls file (调文): 1.
* Input      (输入): 1.
* Output     (输出): 1.
* Return     (返回):
*         success  :
*         failure  :
* Change log (修改): 1.
* Others     (其他): 1.
\*=====================================================================*/
int clear_stack(stack_s *stack);


/*=====================================================================\
* Function   (名称): is_empty()
* Description(功能): 判断栈是否为空
* Called By  (被调): 1.
* Call_B file(被文): 1.
* Calls list (调用): 1.
* Calls file (调文): 1.
* Input      (输入): 1.
* Output     (输出): 1.
* Return     (返回):
*         success  :
*         failure  :
* Change log (修改): 1.
* Others     (其他): 1.
\*=====================================================================*/
int is_empty(stack_s *stack);

/*=====================================================================\
* Function   (名称): output_stack()
* Description(功能): 输出栈元素但不清空栈（这个貌似有点不符合栈的特点).
* Called By  (被调): 1.
* Call_B file(被文): 1.
* Calls list (调用): 1.
* Calls file (调文): 1.
* Input      (输入): 1.
* Output     (输出): 1.
* Return     (返回):
*         success  :
*         failure  :
* Change log (修改): 1.
* Others     (其他): 1.
\*=====================================================================*/
void output_stack(stack_s *stack);

#ifdef __cplusplus
}
#endif

#endif

