/*=========================================================================\
* Copyright(C)2016 Chudai.
*
* File name    : main.c
* Version      : v1.0.0
* Author       : 初代
* Date         : 2016/06/17
* Description  :
* Function list: 1.
*                2.
*                3.
* History      :
\*=========================================================================*/

/*-----------------------------------------------------------*
 * 头文件                                                    *
 *-----------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "queue.h"

/*-----------------------------------------------------------*
 * 外部变量说明                                              *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 外部函数原型说明                                          *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 内部函数原型说明                                          *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 全局变量                                                  *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 模块级变量                                                *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 常量定义                                                  *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 宏定义                                                    *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 函数实现                                                  *
 *-----------------------------------------------------------*/

int main(void)
{
    queue_s     queue;          //这里可以改用指针，为了和前面实验使用不同的方法（前面的用了指针）
    int         option = 0;
    int         len = 0;
    int         ret = 0;
    int         value = 0;

    while(1)
    {
        printf("\n\r1.新建队列\n"
                "\r2.插入元素\n"
                "\r3.删除元素\n"
                "\r4.清空元素\n"
                "\r5.销毁队列\n"
                "\r6.输出队列\n"
                "\r7.退出程序\n");

        printf("请选择:");
        scanf("%d", &option);

        switch(option)
        {
            case 1:
                printf("请输入队列长度: ");
                scanf("%d", &len);
                if ((ret = create_queue(&queue, len))== -1)
                {
                    printf("队列已存在，请先销毁");
                }
                else if (ret == -2)
                {
                    printf("队列长度<=0了.\n");
                }
                else if (ret == -3)
                {
                    printf("内存分配错误.\n");
                }
//                output_queue(queue);
                break;
            case 2:
                printf("请输入要插入的元素值: ");
                scanf("%d", &value);
                if(enqueue(&queue, value) == -1)
                {
                    printf("栈满或栈不存在!\n");
                }
                break;
            case 3:
                if (dequeue(&queue))
                {
                    printf("栈空或栈不存在!\n");
                }
                break;
            case 4:
                if (clear_queue(&queue) == -1)
                {
                    printf("栈不存在!\n");
                }
                break;
            case 5:
                if (destroy_queue(&queue) == -1)
                {
                    printf("栈不存在!\n");
                }
                break;
            case 6:
                if (output_queue(queue) == -1)
                {
                    printf("栈不存在\n");
                }
                break;
            case 7:
                exit(0);
            default:
                break;

        }
    }
}
