/*=========================================================================\
* Copyright(C)2016 Chudai.
*
* File name    : queue.c
* Version      : v1.0.0
* Author       : 初代
* Date         : 2016/06/17
* Description  :
* Function list: 1.
*                2.
*                3.
* History      :
\*=========================================================================*/

/*-----------------------------------------------------------*
 * 头文件                                                    *
 *-----------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "queue.h"

/*-----------------------------------------------------------*
 * 外部变量说明                                              *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 外部函数原型说明                                          *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 内部函数原型说明                                          *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 全局变量                                                  *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 模块级变量                                                *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 常量定义                                                  *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 宏定义                                                    *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 函数实现                                                  *
 *-----------------------------------------------------------*/


/*======================================================================\
* Author     (作者): i.sshe
* Date       (日期): 2016/06/17
* Others     (其他):
\*=======================================================================*/
int create_queue(queue_s *queue, int len)
{
    int     ret = 0;

    if (queue->exist == 1)
    {
        ret = -1;
    }
    else
    {
        if (len <= 0)
        {
            ret = -2;
        }
        else
        {
             queue->array = (int *)malloc(sizeof(int) * len);
             if (queue->array == NULL)
             {
                  printf("malloc error when create queue.");
                  ret = -3;
             }
             else
             {
                  queue->capacity = len;
                  queue->exist = 1;      //
                  queue->front = 0;
                  queue->rear = -1;
                  queue->size = 0;
                  ret = 0;
             }
        }
    }

    return ret;
}


/*======================================================================\
* Author     (作者): i.sshe
* Date       (日期): 2016/06/17
* Others     (其他): 输出队列
\*=======================================================================*/
int output_queue(queue_s queue)
{
     int i = 0;
     int j = queue.front;
     int ret = 0;
//     printf("queue.front=%d\n", queue.front);
//     printf("queue.rear= %d\n", queue.rear);

     if (queue.exist == 0)
     {
 //        printf("空栈!\n");
         ret = -1;
     }
     else
     {
          if (queue.front > queue.rear)
         {
             for(i = 0; i < queue.size; i++)
             {
                  if (j >= queue.capacity)
                  {
                      j == 0;
                  }
                  printf("%d ", queue.array[j++]);
             }
         }
         else
         {
              for(i = 0; i < queue.size; i++)
              {
                  printf("%d ", queue.array[j++]);
              }
         }
         ret = 0;
     }

     return ret;
}


/*======================================================================\
* Author     (作者): i.sshe
* Date       (日期): 2016/06/18
* Others     (其他): 添加元素
\*=======================================================================*/
int enqueue(queue_s *queue, int value)
{
//    printf("value= %d\n", value);
     int    ret = 0;

     //队列不存在或队列满了
     if (queue->exist == 0 || (queue->size >= queue->capacity))
     {
         ret = -1;
     }
     else
     {
         if (queue->rear >= queue->capacity - 1)
         {
              queue->rear = -1;
         }

         queue->array[++queue->rear] = value;
         queue->size++;

         ret = 0;
     }

     return ret;
}



/*======================================================================\
* Author     (作者): i.sshe
* Date       (日期): 2016/06/18
* Others     (其他): 删除元素
\*=======================================================================*/
int dequeue(queue_s *queue)
{
    int     ret = 0;

    if (queue->exist == 0 || queue->size <= 0)
    {
        ret = -1;
    }
    else
    {
         queue->front++;
         queue->size--;
         ret = 0;

         if (queue->front >= queue->capacity)
         {
             queue->front = 0;
         }

   }

    return ret;
}


/*======================================================================\
* Author     (作者): i.sshe
* Date       (日期): 2016/06/18
* Others     (其他): 清空队列
\*=======================================================================*/
int clear_queue(queue_s *queue)
{
     int    ret = 0;
     if (queue->exist == 1)
     {
         queue->size = 0;
         queue->front = 0;
         queue->rear = -1;
         ret = 0;
     }
     else
     {
         ret = -1;
     }

     return ret;
}


/*======================================================================\
* Author     (作者): i.sshe
* Date       (日期): 2016/06/18
* Others     (其他):
\*=======================================================================*/
int destroy_queue(queue_s *queue)
{
     int    ret = 0;
     if (queue->exist == 1)
     {
         queue->exist = 0;
         queue->capacity = 0;
         queue->size = 0;
         queue->front = 0;
         queue->rear = -1;
         free(queue->array);
         queue->array = NULL;

         ret = 0;
     }
     else
     {
          ret = -1;
     }

     return ret;
}
