/*=========================================================================\
* Copyright(C)2016 Chudai.
*
* File name    : main.c
* Version      : v1.0.0
* Author       : 初代
* Date         : 2016/06/19
* Description  :
* Function list: 1.
*                2.
*                3.
* History      :
\*=========================================================================*/

/*-----------------------------------------------------------*
 * 头文件                                                    *
 *-----------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include "binary.h"

/*-----------------------------------------------------------*
 * 外部变量说明                                              *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 外部函数原型说明                                          *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 内部函数原型说明                                          *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 全局变量                                                  *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 模块级变量                                                *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 常量定义                                                  *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 宏定义                                                    *
 *-----------------------------------------------------------*/

/*-----------------------------------------------------------*
 * 函数实现                                                  *
 *-----------------------------------------------------------*/

int main(void)
{
    int         option = 0;
    BTnode_s    *root;
    int         num = 0;
    int         *inorder;
    int         *preorder;
    int         *postorder;
    int         *levelorder;
    int         i = 0;

    // 输入节点个数
    printf("请输入二叉树的节点数目：");
    scanf("%d", &num);
    if (num <= 0)
    {
         printf("无效数目!\n");
         exit(-1);
    }

    inorder = my_malloc(num);
    printf("请输入中序遍历结果:\n");
    input_data(inorder, num);
/*    for (i = 0; i < num; i++)
    {
        printf("%d ", inorder[i]);
    }
*/
    preorder = my_malloc(num);
    printf("请输入先序遍历结果\n");
    input_data(preorder, num);
/*    for (i = 0; i < num; i++)
    {
         printf("%d ", preorder[i]);
    }
*/
    //判断输入是否有误
    if (check_input_data(inorder, preorder, num) == -1)
    {
         printf("输入数据有误!\n");
         exit(-1);
    }

    //构建二叉树
    root = create_binary_tree(preorder, inorder, num);

    printf("重建二叉树后输出先序遍历：\n");
    order_traverse(root, 1);
    printf("\n");

    printf("重建二叉树后输出中序遍历：\n");
    order_traverse(root, 2);
    printf("\n");

    printf("重建二叉树后输出后序遍历：\n");
    //后序遍历
//    postorder = my_malloc(num);
    order_traverse(root, 3);
    printf("\n");

    printf("重建二叉树后输出层次遍历：\n");
    //层次遍历,层次遍历使用队列!
//    levelorder = my_malloc(num);
    order_traverse(root, 4);
    printf("\n");


    return 0;
}
